#pragma once

#define MAX_LENGTH        41                       // Максимальная длина сообщения от клиента
#define MAX_LENGTH_SERVER (256 * (1 + 1 + 20)) + 1 // Максимальная длина сообщения от сервера
#define MAX_PLAYERS_COUNT 256                      // Максимальное количество игроков

/*

     ////////////////////////////////////////////             ////////////////////////////////////////////
     // Структура сообщения клиенту от сервера //             // Структура сообщения серверу от клиента //
     ////////////////////////////////////////////             ////////////////////////////////////////////
+-----------+-----------------------+----------------+   +-----------+-----------------------+----------------+
| Размер    | Значение              | Описание       |   | Размер    | Значение              | Описание       |
| в байтах  |                       |                |   | в байтах  |                       |                |
+-----------+-----------------------+----------------+   +-----------+-----------------------+----------------+
| 1         | server_action_e       | Тип сообщения  |   | 1         | client_action_e       | Тип сообщения  |
+-----------+-----------------------+----------------+   +-----------+-----------------------+----------------+
| ~         | |                     | Остальное      |   | ~         | |                     | Остальное      |
|           | V                     | сообщение      |   |           | V                     | сообщение      |
+-----------+-----------------------+----------------+   +-----------+-----------------------+----------------+

server_action_e::MAP = 1 (Карта)                         client_action_e::CREDENTIALS = 6 (Регистрация/Вход)
+-----------+-----------------------+----------------+   +-----------+-----------------------+----------------+
| Размер    | Значение              | Описание       |   | Размер    | Значение              | Описание       |
| в байтах  |                       |                |   | в байтах  |                       |                |
+-----------+-----------------------+----------------+   +-----------+-----------------------+----------------+
| 1         | X (map_t::size_x)     | Размер карты   |   | 20        | Строка                | Логин          |
|           |                       | по горизонтали |   +-----------+-----------------------+----------------+
+-----------+-----------------------+----------------+   | 20        | Строка                | Пароль         |
| 1         | Y (map_t::size_y)     | Размер карты   |   +-----------+-----------------------+----------------+
|           |                       | по вертикали   |
+-----------+-----------------------+----------------+
| X * Y * 2 | Бинарные данные -     | Карта          |
|           | Два байта на каждую   |                |
|           | клетку (тип + ID)     |                |
+-----------+-----------------------+----------------+

server_action_e::MESSAGE = 2
(Сообщение с результатом команды)
+-----------+-----------------------+----------------+
| Размер    | Значение              | Описание       |
| в байтах  |                       |                |
+-----------+-----------------------+----------------+
| 1         |                       | Код результата |
+-----------+-----------------------+----------------+

server_action_e::NAMES_LIST = 3
(Список имен игроков)
+-----------+-----------------------+----------------+
| Размер    | Значение              | Описание       |
| в байтах  |                       |                |
+-----------+-----------------------+----------------+
| 1         | C                     | Количество     |
|           |                       | игроков        |
+-----------+-----------------------+----------------+
| ~         | |                     | Данные об      |
|           | V                     | именах игроков |
+-----------+-----------------------+----------------+

+-----------+-----------------------+----------------+
| 1         |                       | Номер игрока   |
+-----------+-----------------------+----------------+
| L         |                       | Длина имени    |
|           |                       | игрока         |
+-----------+-----------------------+----------------+
| min(L;20) | player_t::login       | Имя игрока     |
+-----------+-----------------------+----------------+

server_action_e::POINTS_LIST = 4
(Список очков игроков)
+-----------+-----------------------+----------------+
| Размер    | Значение              | Описание       |
| в байтах  |                       |                |
+-----------+-----------------------+----------------+
| 1         | C                     | Количество     |
|           |                       | игроков        |
+-----------+-----------------------+----------------+
| С * 5     | |                     | Данные об      |
|           | V                     | очках игроков  |
+-----------+-----------------------+----------------+

+-----------+-----------------------+----------------+
| 1         |                       | Номер игрока   |
+-----------+-----------------------+----------------+
| 4         | player_t::score       | Очки игрока    |
+-----------+-----------------------+----------------+
*/
